In [2]:
import pandas as pd
adult=pd.read_csv("B:\\downloads\\adult-census-income\\adult.csv")

In [3]:
adult.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

### step to check the ? present in which columns

In [4]:
adult.columns

Index([u'age', u'workclass', u'fnlwgt', u'education', u'education.num',
       u'marital.status', u'occupation', u'relationship', u'race', u'sex',
       u'capital.gain', u'capital.loss', u'hours.per.week', u'native.country',
       u'income'],
      dtype='object')

In [12]:
def vc(x):
    print(x.value_counts())
adult['age'].isnull().value_counts()

False    32561
Name: age, dtype: int64

In [18]:
vc(adult["workclass"]),vc(adult["education"]),vc(adult["marital.status"]),vc(adult["occupation"])
## workclass contains ? value with count 1836 and in occupation

Private             22696
Self-emp-not-inc     2541
Local-gov            2093
?                    1836
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: workclass, dtype: int64
HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: education, dtype: int64
Married-civ-spouse       14976
Never-married            10683
Divorced                  4443
Separated                 1025
Widowed                    993
Married-spouse-absent      418
Married-AF-spouse           23
Name: marital.status, dtype: int64
Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
?                    1843
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

(None, None, None, None)

In [24]:
vc(adult["relationship"]),vc(adult["race"]),vc(adult["sex"]),vc(adult["native.country"]),vc(adult["income"])
#,vc(adult["education"]),vc(adult["marital.status"]),vc(adult["occupation"])
## native_country value with count 586

Husband           13193
Not-in-family      8305
Own-child          5068
Unmarried          3446
Wife               1568
Other-relative      981
Name: relationship, dtype: int64
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64
Male      21790
Female    10771
Name: sex, dtype: int64
United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Trinadad&Tobago                  19
Cambodia                         19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Hungary                          13
Honduras                         13
Scotland                         12
Holand-Netherlands                1
Name: native.country, dtype: int64
<=50K    24720
>50K      7841
Name: income, dtype: int64

(None, None, None, None, None)

In [34]:
adult_d=adult.fillna('?')

In [35]:
adult_d.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [41]:
adult_d.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education.num      int64
marital.status    object
occupation        object
relationship      object
race              object
sex               object
capital.gain       int64
capital.loss       int64
hours.per.week     int64
native.country    object
income            object
dtype: object

### replace the '?' into None

In [48]:
#adult_d.replace('-', np.nan)
adult_d.replace({'?': None},inplace=True)

In [ ]:
adult_d.head()

### to check the which null value is present in which colunms

In [50]:
adult_d.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In [51]:
adult_d.columns[adult_d.isnull().any()].tolist()

['workclass', 'occupation', 'native.country']

In [63]:
adnu=adult_d[(adult_d['workclass'].isnull())& (adult_d['occupation'].isnull()) &(adult_d['native.country'].isnull())]

In [68]:
adn=adult_d[(adult_d['workclass'].isnull())& (adult_d['occupation'].isnull())]
adnu.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
1181,68,None,286869,7th-8th,4,Widowed,None,Not-in-family,White,Female,0,1668,40,None,<=50K
1204,41,None,211873,Assoc-voc,11,Married-civ-spouse,None,Wife,White,Female,0,1628,5,None,<=50K
2591,38,None,94559,Bachelors,13,Married-civ-spouse,None,Wife,Other,Female,7688,0,50,None,>50K
3415,47,None,174525,HS-grad,9,Married-civ-spouse,None,Husband,White,Male,3942,0,40,None,<=50K
3508,39,None,157443,Masters,14,Married-civ-spouse,None,Wife,Asian-Pac-Islander,Female,3464,0,40,None,<=50K

In [66]:
print "the all null present ",len(adnu)

the all null present  27

In [69]:
print "the all null present in both columns commely ",len(adn)

the all null present in both columns commely  1836

In [70]:
print " the total number of rows present in in adult_dataset",len(adult_d)

 the total number of rows present in in adult_dataset 32561

##### remove the null value in data set

In [83]:
adult_data_nullvalue_drop = adult_d.dropna(how="any")

In [84]:
adult_data_nullvalue_drop.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [85]:
len(adult_data_nullvalue_drop)

30162

In [86]:
len(adult_d)

32561

In [87]:
32561-30162

2399

In [88]:
### now remove the row which has the both null value

In [89]:
adult_data=adult_d.dropna(subset=["workclass","occupation"])

In [90]:
adult_data.isnull().sum()

age                 0
workclass           0
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation          0
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      0
native.country    556
income              0
dtype: int64

####  if we see above only null vale present in workclass and occupation is been remove

In [91]:
len(adult_data)

30718

In [92]:
adult_data.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education.num      int64
marital.status    object
occupation        object
relationship      object
race              object
sex               object
capital.gain       int64
capital.loss       int64
hours.per.week     int64
native.country    object
income            object
dtype: object

In [94]:
adult_data["age"].value_counts()

36    875
31    869
34    860
33    849
37    849
35    844
30    832
23    830
28    826
38    810
25    809
39    804
32    803
27    802
41    790
29    785
40    777
42    765
24    764
26    763
43    757
46    726
45    723
44    714
47    694
22    686
20    637
21    631
19    599
50    588
     ...
17    330
60    281
61    264
62    216
63    191
64    177
65    139
66    113
67    112
68     92
69     80
70     65
71     54
73     49
72     42
74     39
90     36
75     34
76     30
77     20
80     16
79     15
81     14
78     14
84      8
82      7
83      5
88      3
85      3
86      1
Name: age, Length: 72, dtype: int64

In [96]:
adult_data["sex"].value_counts()

Male      20788
Female     9930
Name: sex, dtype: int64

In [99]:
adult_data["education"].value_counts()

HS-grad         9968
Some-college    6775
Bachelors       5182
Masters         1675
Assoc-voc       1321
11th            1056
Assoc-acdm      1020
10th             831
7th-8th          573
Prof-school      558
9th              463
Doctorate        398
12th             393
5th-6th          303
1st-4th          156
Preschool         46
Name: education, dtype: int64

In [100]:
adult_data["income"].value_counts()

<=50K    23068
>50K      7650
Name: income, dtype: int64

## Boolean Indexing

#### now we are going create table by using boolean using

In [109]:
adult_data.loc[(adult_data["sex"]=="Female")&(adult_data["age"]>40)& 
               (adult_data["education"]=="HS-grad")& (adult_data["income"]=='>50K'),
                                                      ["sex","age","education","income"]]

          sex  age education income
51     Female   50   HS-grad   >50K
122    Female   49   HS-grad   >50K
187    Female   48   HS-grad   >50K
189    Female   55   HS-grad   >50K
807    Female   55   HS-grad   >50K
971    Female   48   HS-grad   >50K
1577   Female   50   HS-grad   >50K
1581   Female   56   HS-grad   >50K
1605   Female   51   HS-grad   >50K
1646   Female   60   HS-grad   >50K
1738   Female   64   HS-grad   >50K
1756   Female   67   HS-grad   >50K
1774   Female   74   HS-grad   >50K
1775   Female   67   HS-grad   >50K
1777   Female   67   HS-grad   >50K
1781   Female   58   HS-grad   >50K
1803   Female   53   HS-grad   >50K
1820   Female   47   HS-grad   >50K
1932   Female   60   HS-grad   >50K
1950   Female   61   HS-grad   >50K
2104   Female   46   HS-grad   >50K
2126   Female   52   HS-grad   >50K
2132   Female   44   HS-grad   >50K
2145   Female   41   HS-grad   >50K
2188   Female   49   HS-grad   >50K
2192   Female   47   HS-grad   >50K
2359   Female   43   HS-grad   >50K
2368   Female   64   HS-grad   >50K
2389   Female   46   HS-grad   >50K
2450   Female   53   HS-grad   >50K
...       ...  ...       ...    ...
19390  Female   47   HS-grad   >50K
19804  Female   58   HS-grad   >50K
20301  Female   51   HS-grad   >50K
20677  Female   58   HS-grad   >50K
21127  Female   50   HS-grad   >50K
21175  Female   43   HS-grad   >50K
21973  Female   58   HS-grad   >50K
23143  Female   43   HS-grad   >50K
23463  Female   53   HS-grad   >50K
23685  Female   54   HS-grad   >50K
24542  Female   66   HS-grad   >50K
25120  Female   46   HS-grad   >50K
25499  Female   63   HS-grad   >50K
25728  Female   53   HS-grad   >50K
25965  Female   43   HS-grad   >50K
26197  Female   43   HS-grad   >50K
26349  Female   47   HS-grad   >50K
26803  Female   42   HS-grad   >50K
27561  Female   41   HS-grad   >50K
28772  Female   43   HS-grad   >50K
29235  Female   59   HS-grad   >50K
29408  Female   48   HS-grad   >50K
29818  Female   42   HS-grad   >50K
30013  Female   44   HS-grad   >50K
30381  Female   58   HS-grad   >50K
30603  Female   42   HS-grad   >50K
30890  Female   56   HS-grad   >50K
31151  Female   45   HS-grad   >50K
32325  Female   47   HS-grad   >50K
32405  Female   59   HS-grad   >50K

[124 rows x 4 columns]

In [110]:
adult_data.loc[(adult_data["sex"]=="Male")&(adult_data["age"]>50)& 
               (adult_data["education"]=="Bachelors")& (adult_data["income"]=='<=50K'),
                                                      ["sex","age","education","income"]]

        sex  age  education income
171    Male   57  Bachelors  <=50K
289    Male   59  Bachelors  <=50K
316    Male   56  Bachelors  <=50K
658    Male   51  Bachelors  <=50K
1039   Male   63  Bachelors  <=50K
1131   Male   51  Bachelors  <=50K
1330   Male   55  Bachelors  <=50K
1421   Male   57  Bachelors  <=50K
1468   Male   54  Bachelors  <=50K
2241   Male   90  Bachelors  <=50K
2951   Male   65  Bachelors  <=50K
3135   Male   59  Bachelors  <=50K
3259   Male   57  Bachelors  <=50K
3264   Male   56  Bachelors  <=50K
3467   Male   69  Bachelors  <=50K
3472   Male   77  Bachelors  <=50K
3473   Male   65  Bachelors  <=50K
4030   Male   57  Bachelors  <=50K
4124   Male   72  Bachelors  <=50K
4136   Male   73  Bachelors  <=50K
4267   Male   53  Bachelors  <=50K
4304   Male   52  Bachelors  <=50K
4746   Male   57  Bachelors  <=50K
4770   Male   52  Bachelors  <=50K
5104   Male   58  Bachelors  <=50K
5199   Male   53  Bachelors  <=50K
5896   Male   90  Bachelors  <=50K
5990   Male   53  Bachelors  <=50K
6279   Male   61  Bachelors  <=50K
6370   Male   74  Bachelors  <=50K
...     ...  ...        ...    ...
27000  Male   61  Bachelors  <=50K
27172  Male   51  Bachelors  <=50K
27218  Male   60  Bachelors  <=50K
27418  Male   55  Bachelors  <=50K
27609  Male   66  Bachelors  <=50K
27826  Male   57  Bachelors  <=50K
27846  Male   58  Bachelors  <=50K
27947  Male   66  Bachelors  <=50K
27991  Male   55  Bachelors  <=50K
28150  Male   62  Bachelors  <=50K
28551  Male   60  Bachelors  <=50K
28917  Male   64  Bachelors  <=50K
28920  Male   57  Bachelors  <=50K
28932  Male   54  Bachelors  <=50K
29142  Male   57  Bachelors  <=50K
29340  Male   51  Bachelors  <=50K
29626  Male   67  Bachelors  <=50K
29875  Male   52  Bachelors  <=50K
30140  Male   54  Bachelors  <=50K
30164  Male   62  Bachelors  <=50K
30224  Male   63  Bachelors  <=50K
31317  Male   53  Bachelors  <=50K
31658  Male   73  Bachelors  <=50K
31683  Male   52  Bachelors  <=50K
31836  Male   52  Bachelors  <=50K
31929  Male   67  Bachelors  <=50K
32075  Male   51  Bachelors  <=50K
32107  Male   56  Bachelors  <=50K
32208  Male   59  Bachelors  <=50K
32468  Male   85  Bachelors  <=50K

[236 rows x 4 columns]

In [132]:
adult_m50=adult_data.loc[(adult_data["sex"]=="Male")&(adult_data["age"]>60)& 
               (adult_data["education"]=="Masters")& (adult_data["income"]=='>50K'),
                                                      ["sex","age","education","income"]]

In [134]:
adult_m50.head()
#len(adult_m50)

       sex  age education income
119   Male   68   Masters   >50K
132   Male   68   Masters   >50K
191   Male   70   Masters   >50K
1650  Male   71   Masters   >50K
1736  Male   65   Masters   >50K

##2 – Apply Function

##### It is one of the commonly used functions for playing with data and creating new variables. Apply returns some value after passing each row/column of a data frame with some function. The function can be both default or user-defined. For instance, here it can be used to find the #missing values in each row and column.

In [139]:
def caps(x):
    return x.upper()

In [140]:
adult_m50["sex"].apply(caps)

119      MALE
132      MALE
191      MALE
1650     MALE
1736     MALE
1739     MALE
1741     MALE
1773     MALE
2228     MALE
2307     MALE
2810     MALE
2953     MALE
2956     MALE
2987     MALE
4320     MALE
4541     MALE
5278     MALE
6117     MALE
6240     MALE
6245     MALE
6852     MALE
8725     MALE
8914     MALE
8986     MALE
10595    MALE
11100    MALE
12813    MALE
12817    MALE
15197    MALE
16774    MALE
17879    MALE
21145    MALE
26663    MALE
27709    MALE
28307    MALE
29338    MALE
31079    MALE
32451    MALE
Name: sex, dtype: object

In [141]:
#Create a new function:
def num_missing(x):
    return sum(x.isnull())

#Applying per column:
print "Missing values per column:"
print adult_d.apply(num_missing, axis=0) #axis=0 defines that function is to be applied on each column

#Applying per row:
print "\nMissing values per row:"
print adult_d.apply(num_missing, axis=1).head() #axis=1 defines that function is to be applied on each row

Missing values per column:
age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

Missing values per row:
0    2
1    0
2    2
3    0
4    0
dtype: int64

In [147]:
adult_m50["age"].apply(lambda x: x**2)

119      4624
132      4624
191      4900
1650     5041
1736     4225
1739     8100
1741     4489
1773     4489
2228     5041
2307     4900
2810     3721
2953     4225
2956     4761
2987     4225
4320     5776
4541     3844
5278     3721
6117     3969
6240     3844
6245     3969
6852     3721
8725     5776
8914     8100
8986     3844
10595    4489
11100    5329
12813    3721
12817    3969
15197    3969
16774    4096
17879    3844
21145    4489
26663    4489
27709    3969
28307    3721
29338    3721
31079    4489
32451    4356
Name: age, dtype: int64

In [148]:
def subt(x, custom_value):
       return x-custom_value

In [149]:
adult_m50["age"].apply(subt, args=(5,))

119      63
132      63
191      65
1650     66
1736     60
1739     85
1741     62
1773     62
2228     66
2307     65
2810     56
2953     60
2956     64
2987     60
4320     71
4541     57
5278     56
6117     58
6240     57
6245     58
6852     56
8725     71
8914     85
8986     57
10595    62
11100    68
12813    56
12817    58
15197    58
16774    59
17879    57
21145    62
26663    62
27709    58
28307    56
29338    56
31079    62
32451    61
Name: age, dtype: int64

###  Imputing missing files

In [150]:
titanic=pd.read_csv("B:/data science courses/Titanic project/train.csv")

In [151]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [153]:
titanic.columns[titanic.isnull().any()].tolist()

['Age', 'Cabin', 'Embarked']

In [154]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [159]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### so age is integer value we can fill with mean or medium or mode

In [167]:
titanic['Age'].fillna((titanic['Age'].mean), inplace=True)

In [168]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### if look at above data means its clear that the age nan value fill with mean

In [169]:
titanic.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [171]:
titanic.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [173]:
titanic['Embarked'].fillna(("S"),inplace=True)

In [174]:
titanic.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [176]:
titanic.Cabin.value_counts()

C23 C25 C27        4
G6                 4
B96 B98            4
D                  3
C22 C26            3
E101               3
F2                 3
F33                3
B57 B59 B63 B66    2
C68                2
B58 B60            2
E121               2
D20                2
E8                 2
E44                2
B77                2
C65                2
D26                2
E24                2
E25                2
B20                2
C93                2
D33                2
E67                2
D35                2
D36                2
C52                2
F4                 2
C125               2
C124               2
                  ..
F G63              1
A6                 1
D45                1
D6                 1
D56                1
C101               1
C54                1
D28                1
D37                1
B102               1
D30                1
E17                1
E58                1
F E69              1
D10 D12            1
E50                1
A14                1
C91                1
A16                1
B38                1
B39                1
C95                1
B78                1
B79                1
C99                1
B37                1
A19                1
E12                1
A7                 1
D15                1
Name: Cabin, Length: 147, dtype: int64